In [212]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
import pandas.io.sql as psql
import mysql.connector

### Store World Cup Matches CSV into DataFrame

In [195]:
csv_file = "../Resources/WorldCupMatches.csv"
WorldCupMatches_df = pd.read_csv(csv_file)
WorldCupMatches_df.tail()

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
4567,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4568,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4569,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4570,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4571,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Create new data with select columns

In [196]:
matches_df = WorldCupMatches_df[['Year', 'Stage', 'Home Team Name', 'Home Team Goals', 'Away Team Goals',
                                'Away Team Name', 'MatchID', 'Home Team Initials', 'Away Team Initials', ]].copy()
matches_df.head()

,Year,Stage,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,MatchID,Home Team Initials,Away Team Initials
0,1930.0,Group 1,France,4.0,1.0,Mexico,1096.0,FRA,MEX
1,1930.0,Group 4,USA,3.0,0.0,Belgium,1090.0,USA,BEL
2,1930.0,Group 2,Yugoslavia,2.0,1.0,Brazil,1093.0,YUG,BRA
3,1930.0,Group 3,Romania,3.0,1.0,Peru,1098.0,ROU,PER
4,1930.0,Group 1,Argentina,1.0,0.0,France,1085.0,ARG,FRA

### Store World Cup Players CSV into a DataFrame

In [197]:
csv_file = "../Resources/WorldCupPlayers.csv"
WorldCupPlayers_df = pd.read_csv(csv_file)
WorldCupPlayers_df.tail()

,RoundID,MatchID,Team Initials,Coach Name,Line-up,Shirt Number,Player Name,Position,Event
37779,255959,300186501,ARG,SABELLA Alejandro (ARG),N,19,ALVAREZ,NaN,NaN
37780,255959,300186501,GER,LOEW Joachim (GER),N,6,KHEDIRA,NaN,NaN
37781,255959,300186501,ARG,SABELLA Alejandro (ARG),N,20,AGUERO,NaN,IH46' Y65'
37782,255959,300186501,GER,LOEW Joachim (GER),N,21,MUSTAFI,NaN,NaN
37783,255959,300186501,ARG,SABELLA Alejandro (ARG),N,23,BASANTA,NaN,NaN

### Clean DataFrame

In [198]:
players_df = WorldCupPlayers_df[["MatchID", "Team Initials", "Line-up", "Player Name", "Event"]].copy()
players_df.tail()

         MatchID Team Initials Line-up Player Name       Event
37779  300186501           ARG       N     ALVAREZ         NaN
37780  300186501           GER       N     KHEDIRA         NaN
37781  300186501           ARG       N      AGUERO  IH46' Y65'
37782  300186501           GER       N     MUSTAFI         NaN
37783  300186501           ARG       N     BASANTA         NaN

In [199]:
csv_file = "../Resources/WorldCups.csv"
WorldCups = pd.read_csv(csv_file)
WorldCups.tail()

,Year,Country,Winner,Runners-Up,Third,Fourth,GoalsScored,QualifiedTeams,MatchesPlayed,Attendance
15,1998,France,France,Brazil,Croatia,Netherlands,171,32,64,2.785.100
16,2002,Korea/Japan,Brazil,Germany,Turkey,Korea Republic,161,32,64,2.705.197
17,2006,Germany,Italy,France,Germany,Portugal,147,32,64,3.359.439
18,2010,South Africa,Spain,Netherlands,Germany,Uruguay,145,32,64,3.178.856
19,2014,Brazil,Germany,Argentina,Netherlands,Brazil,171,32,64,3.386.810

In [200]:
#worldCup_df = WorldCups[["id", "address", "us_state"]].copy()
#worldCup_df.head()

In [201]:
csv_file = "../Resources/GLOBSES.csv"
GLOBES_df = pd.read_csv(csv_file, encoding="ISO-8859-1") ## Had to rename from GLOB.SES and to
## and we had to determine the encoding character set
GLOBES_df.tail()

      unid wbid   country  year        SES      gdppc  yrseduc  popshare
2081   716  ZWE  Zimbabwe  1940  52.746567   813.0000      NaN  0.001113
2082   716  ZWE  Zimbabwe  2010  27.091389  1388.9730      NaN  0.002074
2083   716  ZWE  Zimbabwe  1990  59.110970  2526.0723      NaN  0.002039
2084   716  ZWE  Zimbabwe  1900  54.722645   601.0000      NaN  0.000996
2085   716  ZWE  Zimbabwe  1960  53.811077   938.0000      NaN  0.001268

In [202]:
# new_customer_location_df = customer_location_df[["id", "address", "us_state"]].copy()
# new_customer_location_df.head()

### Connect to local database

In [203]:
## A password is required, a database is not required
conn = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             db='')

OperationalError: (1045, "Access denied for user 'root'@'localhost' (using password: NO)")

In [204]:
cursor = conn.cursor()

### Create Database

In [186]:
cursor.execute('drop database etl_project')

0

In [187]:
cursor.execute('CREATE DATABASE etl_project')

1

In [188]:
cursor.execute('USE etl_project')

0

In [189]:
query = "select * from TABLENAME"

In [190]:
# Create a table with an auto increment row as the primary key
# cursor.execute('CREATE TABLE WorldCupMatches (matches INT NOT NULL AUTO_INCREMENT, year PRIMARY KEY (matches))')
#cursor.execute('CREATE TABLE WorldCupPlayers (players INT NOT NULL AUTO_INCREMENT, PRIMARY KEY (players))')
#cursor.execute('CREATE TABLE WorldCups (world_cups INT NOT NULL AUTO_INCREMENT, PRIMARY KEY (world_cups))')

In [191]:
#cursor.execute("SHOW TABLES")

In [192]:
result = cursor.fetchall()
for row in result:
    print(row)

In [183]:
# conn.close()

In [105]:
## This is where I stopped.

### Use pandas to load csv converted DataFrame into database

In [207]:
#new_customer_data_df.to_sql(name='WorldCupMatches_df', con=conn, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [167]:
conn = pymysql.connect(host=localhost, port=3306, user=root, passwd=passw)

conn.cursor().execute("CREATE etl_project IF NOT EXISTS {0} ".format(database))
conn = pymysql.connect(host=host,
                       port=port,
                       user=user, 
                       passwd=passw,  
                       db=etl_project,
                       charset='utf8')

data.to_sql(name=etl_project, con=conn, if_exists = 'replace', index=False, flavor = 'mysql')

In [208]:
GLOBES_df.head()

   unid wbid      country  year        SES      gdppc  yrseduc  popshare
0     4  AFG  Afghanistan  1970   3.474212  709.00000      NaN  0.003097
1     4  AFG  Afghanistan  1920  26.968016  731.75677      NaN  0.003245
2     4  AFG  Afghanistan  1990   1.269530  604.00000      NaN  0.002347
3     4  AFG  Afghanistan  1960  15.763076  739.00000      NaN  0.003039
4     4  AFG  Afghanistan  2000   2.061114  565.00000      NaN  0.003309

In [213]:
engine = create_engine('mysql://root:@localhost:3306/etl_project', echo=False)
# data.to_sql(name='GLOBSES_df', con=engine, if_exists = 'append', index=False)

ModuleNotFoundError: No module named 'MySQLdb'

In [206]:
#engine.table_names()

In [ ]:
#new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [24]:
pd.read_sql_query('select * from customer_name', con=engine).head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Confirm data has been added by querying the customer_location table

In [27]:
pd.read_sql_query('select * from customer_location a join customer_name b on a.id = b.id', con=engine).head()

   id                address us_state  id first_name last_name
0   1  043 Mockingbird Place  Indiana   1    Benetta   Cancott
1   1  043 Mockingbird Place  Indiana   1    Benetta   Cancott
2   2       4 Prentice Point  Indiana   2     Lilyan    Cherry
3   2       4 Prentice Point  Indiana   2     Lilyan    Cherry
4   3      46 Derek Junction    Texas   3    Ezekiel   Benasik

In [ ]:
pd.rea